
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	УстановитьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	УстановитьСумму();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьСумму()
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	Возврат Номенклатура.ЦенаПокупки;
КонецФункции


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Цена = ПолучитьЦенуНоменклатуры(ТекДанные.Номенклатура);
КонецПроцедуры
